LonelyWolf/stm32/bike-computer/GUI.c
// Screen with RAW data packet
void GUI_Screen_SensorRAW(funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t X,Y;

	do {
		// Frame
		UC1701_Fill(0x00);
		Rect(0,4,scr_width - 1,scr_height - 1,PSet);
		HLine(4,scr_width - 5,4,PReset);
		PutStr(19,1,"Sensor RAW data",&Font5x7);
		InvertRect(4,0,scr_width - 8,9);
		// Cadence data
		X = 5; Y = 10;
		X += PutStr(X,Y,"CDC c:",&Font5x7) - 1;
		PutInt(X,Y,nRF24_Packet.tim_CDC,&Font5x7);
		// Speed data
		X = 5; Y += 9;
		X += PutStr(X,Y,"SPD c:",&Font5x7) - 1;
		X += PutInt(X,Y,nRF24_Packet.cntr_SPD,&Font5x7) + 8;
		X += PutStr(X,Y,"t:",&Font5x7) - 1;
		PutInt(X,Y,nRF24_Packet.tim_SPD,&Font5x7);
		// Packets lost
		X = 5; Y += 9;
		X += PutStr(X,Y,"P.Lost:",&Font5x7) - 1;
		X += PutInt(X,Y,nRF24_Packet.packets_lost,&Font5x7) + 5;
		// OBSERVER_TX
		X += PutStr(X,Y,"OTX:",&Font5x7) - 1;
		X += PutHex(X,Y,nRF24_Packet.observe_TX,&Font5x7);
		// Wake-ups
		X = 5; Y += 9;
		X += PutStr(X,Y,"Wake:",&Font5x7) - 1;
		PutInt(X,Y,nRF24_Packet.cntr_wake,&Font5x7);
		X = 76;
		X += PutStr(X,Y,"RT:",&Font5x7) - 1;
		PutInt(X,Y,nRF24_Packet.ride_time,&Font5x7);
		// Battery
		X = 5; Y += 9;
		X += PutStr(X,Y,"Battery:",&Font5x7) - 1;
		PutChar(X + PutIntF(X,Y,nRF24_Packet.vrefint,2,&Font5x7),Y,'V',&Font5x7);

		UC1701_Flush();

		if (WaitForKey) WaitForKey(TRUE,&GUI_refresh); else return;
		GUI_refresh = FALSE;
		if (!BTN[BTN_ESCAPE].cntr) ClearKeys();
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Screen with current values (trip data)
void GUI_Screen_CurVal1(funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t X,Y;

	do {
		// Frame
		UC1701_Fill(0x00);
		Rect(0,4,scr_width - 1,scr_height - 1,PSet);
		HLine(4,scr_width - 5,4,PReset);
		PutStr(18,1,"Trip statistics",&Font5x7);
		InvertRect(4,0,scr_width - 8,9);

		X = 4; Y = 10;
		X += PutStr(X,Y,"SPD:",&Font5x7) - 1;
		PutIntF(X,Y,CurData.Speed,1,&Font5x7);
		X = 63;
		X += PutStr(X,Y,"CDC:",&Font5x7) - 1;
		PutInt(X,Y,CurData.Cadence,&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"A.S:",&Font5x7) - 1;
		PutIntF(X,Y,CurData.AvgSpeed,1,&Font5x7);
		X = 63;
		X += PutStr(X,Y,"A.C:",&Font5x7) - 1;
		PutInt(X,Y,CurData.AvgCadence,&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"M.S:",&Font5x7) - 1;
		PutIntF(X,Y,CurData.MaxSpeed,1,&Font5x7);
		X = 63;
		X += PutStr(X,Y,"M.C:",&Font5x7) - 1;
		PutInt(X,Y,CurData.MaxCadence,&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"T.D:",&Font5x7) - 1;
		X += PutIntF(X,Y,CurData.TripDist / 100,3,&Font5x7);
		PutStr(X,Y,"km",&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Odo:",&Font5x7) - 1;
		X += PutIntF(X,Y,CurData.Odometer / 10000,1,&Font5x7);
		PutStr(X,Y,"km",&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Time:",&Font5x7) - 1;
		GUI_PutTimeSec(X,Y,CurData.TripTime,&Font5x7);
		UC1701_Flush();

		if (WaitForKey) WaitForKey(TRUE,&GUI_refresh); else return;
		GUI_refresh = FALSE;
		if (!BTN[BTN_ESCAPE].cntr) ClearKeys();
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Screen with current values (BMP180 values)
void GUI_Screen_CurVal2(funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t X,Y;

	do {
		// Frame
		UC1701_Fill(0x00);
		Rect(0,4,scr_width - 1,scr_height - 1,PSet);
		HLine(4,scr_width - 5,4,PReset);
		PutStr(24,1,"BMP180 values",&Font5x7);
		InvertRect(4,0,scr_width - 8,9);

		X = 4; Y = 10;
		X += PutStr(X,Y,"Temperature:",&Font5x7) - 1;
		GUI_PutTemperature(X,Y,CurData.Temperature,&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Min:",&Font5x7) - 1;
		GUI_PutTemperature(X,Y,CurData.MinTemperature,&Font5x7);
		X = 67;
		X += PutStr(X,Y,"Max:",&Font5x7) - 1;
		GUI_PutTemperature(X,Y,CurData.MaxTemperature,&Font5x7);

		HLine(1,scr_width - 2,Y + 10,PSet);

		X = 4; Y += 14;
		X += PutStr(X,Y,"Pressure:",&Font5x7) - 1;
		GUI_PutPressure(X,Y,CurData.Pressure,PT_mmHg,&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Min:",&Font5x7) - 1;
		PutIntF(X,Y,CurData.MinPressure * 75 / 1000,1,&Font5x7);
		X = 67;
		X += PutStr(X,Y,"Max:",&Font5x7) - 1;
		PutIntF(X,Y,CurData.MaxPressure * 75 / 1000,1,&Font5x7);

		UC1701_Flush();

		if (WaitForKey) WaitForKey(TRUE,&GUI_new_BMP180); else return;
		GUI_new_BMP180 = FALSE;
		if (!BTN[BTN_ESCAPE].cntr) ClearKeys();
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Screen with current values (GPS values)
void GUI_Screen_CurVal3(funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t X,Y;

	do {
		// Frame
		UC1701_Fill(0x00);
		Rect(0,4,scr_width - 1,scr_height - 1,PSet);
		HLine(4,scr_width - 5,4,PReset);
		PutStr(9,1,"GPS current values",&Font5x7);
		InvertRect(4,0,scr_width - 8,9);

		X = 4; Y = 10;
		X += PutStr(X,Y,"Speed:",&Font5x7) - 1;
		X += PutIntF(X,Y,CurData.GPSSpeed,2,&Font5x7);
		PutStr(X,Y,"km/h",&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Max:",&Font5x7) - 1;
		X += PutIntF(X,Y,CurData.MaxGPSSpeed,2,&Font5x7);
		PutStr(X,Y,"km/h",&Font5x7);

		HLine(1,scr_width - 2,Y + 10,PSet);

		X = 4; Y += 14;
		X += PutStr(X,Y,"Altitude:",&Font5x7) - 1;
		X += PutInt(X,Y,CurData.GPSAlt,&Font5x7);
		PutChar(X,Y,'m',&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Min:",&Font5x7) - 1;
		X += PutInt(X,Y,CurData.MinGPSAlt,&Font5x7);
		PutChar(X,Y,'m',&Font5x7);
		X = 4; Y += 9;
		X += PutStr(X,Y,"Max:",&Font5x7) - 1;
		X += PutInt(X,Y,CurData.MaxGPSAlt,&Font5x7);
		PutChar(X,Y,'m',&Font5x7);

		UC1701_Flush();

		if (WaitForKey) WaitForKey(TRUE,&GPS_new_data); else return;
		GPS_new_data = FALSE;
		if (!BTN[BTN_ESCAPE].cntr) ClearKeys();
	} while (!BTN[BTN_ESCAPE].cntr);

	BTN[BTN_ESCAPE].cntr = 0;;
	UC1701_Fill(0x00);
}

// Screen with satellites in view bar graph
// input:
//   WaitForKey - function pointer to WaitForKeyPress function
// note: if WaitForKey are NULL - just draw screen and return
void GUI_Screen_GPSSatsView(funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t i;
	uint8_t X;
	uint8_t Y;
	uint8_t sats;
	uint8_t max_SNR;

	do {
		ClearKeys();

		sats = GPSData.sats_view;
		max_SNR = 40;

		// Used satellites can be no more than 12 (from $GPGGA)
		if (sats > 12) sats = 12;

		// Find maximal SNR
		for (i = 0; i < sats; i++) {
			if (GPS_sats_view[i].SNR > max_SNR && GPS_sats_view[i].SNR != 255) max_SNR = GPS_sats_view[i].SNR;
		}

