LonelyWolf/stm32/bike-computer/GUI.c
	// Find maximal and minimal values
	min = data[0]; max = data[0];
	for (i = 0; i < W; i++) {
		if (data[i] < min) min = data[i];
		if (data[i] > max) max = data[i];
	}
	// Scale ratio
	mY = (H - 1) / (float)(max - min);
	if (mY > H / 10) {
		mY = H / 10;
		offset = (H / 2) - ((max - min) * mY / 2);
	} else offset = 0;
	// Bottom line of the graph
	bY = Y + H - 1;

	// Draw graph
	if (GraphType == GT_dot) {
		// Dots
		for(i = 0; i < W; i++) SetPixel(X + i,bY - (uint16_t)((data[i] - min) * mY) - offset);
	} else if (GraphType == GT_line) {
		// Continuous line
		pY = bY - (uint16_t)((data[0] - min) * mY) - offset;
		for(i = 1; i < W; i++) {
			YY = bY - (uint16_t)((data[i] - min) * mY) - offset;
			Line(X + i - 1,pY,X + i,YY);
			pY = YY;
		}
	} else {
		// Filled graph
		for(i = 0; i < W; i++) VLine(X + i,bY - (uint16_t)((data[i] - min) * mY) - offset,bY,PSet);
	}
}

// Put coordinates in format "Ndd.xxxxxx"
// input:
//   X,Y - top left coordinates of the text
//   degree - coordinates degree
//   seconds - coordinates seconds
//   ch - coordinates character
//   Font - pointer to font
uint8_t GUI_PutCoord(uint8_t X, uint8_t Y, uint8_t degree, uint32_t seconds, char ch, const Font_TypeDef *Font) {
	uint8_t pX = X;

	X += PutChar(X,Y,ch,Font);
	X += PutIntF(X,Y,(degree * 1000000) + (seconds / 60),6,Font);

	return X - pX;
}

// Draw time with standard 5x7 font
// input:
//   X,Y - top left coordinates of the text
//   time - time in seconds (max value = 3599999 seconds or 999:59:59)
//   Font - pointer to font
uint8_t GUI_PutTimeSec(uint8_t X, uint8_t Y, uint32_t time, const Font_TypeDef *Font) {
	uint8_t pX = X;
	uint16_t hours;
	uint8_t minutes,seconds;

	hours   = time / 3600;
	minutes = (time / 60) % 60;
	seconds = time % 60;
	if (hours > 999) {
		hours   = 999;
		minutes = 59;
		seconds = 59;
	}

	if (hours < 10)	X += PutChar(X,Y,'0',Font);
	X += PutInt(X,Y,hours,Font);
	X += PutChar(X,Y,':',Font) - 1;

	if (minutes < 10) X += PutChar(X,Y,'0',Font);
	X += PutInt(X,Y,minutes,Font);
	X += PutChar(X,Y,':',Font) - 1;

	if (seconds < 10) X += PutChar(X,Y,'0',Font);
	X += PutInt(X,Y,seconds,Font);

	return X - pX;
}

// Draw date with standard 5x7 font
// input:
//   X,Y - top left coordinates of text
//   date - date in format DDMMYYYY
//   Font - pointer to font
uint8_t GUI_PutDate(uint8_t X, uint8_t Y, uint32_t date, const Font_TypeDef *Font) {
	uint8_t pX = X;
	uint16_t dig;

	// Day
	dig = date / 1000000;
	X += PutIntLZ(X,Y,dig,2,Font) - 1;
	X += PutChar(X,Y,'.',Font) - 1;

	// Month
	dig = (date - (dig * 1000000)) / 10000;
	X += PutIntLZ(X,Y,dig,2,Font) - 1;
	X += PutChar(X,Y,'.',Font) - 1;

	// Year
	dig = date % 10000;
	X += PutIntLZ(X,Y,dig,4,Font);

	return X - pX;
}

// Print pressure with 'mmHg'
// input:
//   X,Y - top left coordinates of text
//   pressure - pressure value in Pa
//   PressureType - what units pressure should be displayed (PT_hPa, PT_mmHg)
//   Font - pointer to font
uint8_t GUI_PutPressure(uint8_t X, uint8_t Y, int32_t pressure, PressureType_TypeDef PressureType,
		const Font_TypeDef *Font) {
	uint8_t pX = X;

	if (PressureType == PT_mmHg) {
		pressure = pressure * 75 / 1000;
		X += PutIntF(X,Y,pressure,1,Font);
		X += PutStr(X,Y,"mmHg",Font);
	} else {
		X += PutIntF(X,Y,pressure,2,Font);
		X += PutStr(X,Y,"hPa",Font);
	}

	return X - pX;
}

// Print temperature value with Celsius sign
// input:
//   X,Y - top left coordinates of text
//   temperature - temperature value in Celsius degree
//   Font - pointer to font
uint8_t GUI_PutTemperature(uint8_t X, uint8_t Y, int32_t temperature, const Font_TypeDef *Font) {
	uint8_t pX = X;

	if (temperature < 0) {
		HLine(X,X + 2,Y + 3,PSet);
		temperature *= -1;
		X += 4;
	}
	X += PutInt(X,Y,temperature / 10,Font);

	// Decimal point
	Rect(X,Y + Font->font_Height - 2,X + 1,Y + Font->font_Height - 1,PSet);
	X += 3;

	// Temperature fractional
	X += PutInt(X,Y,temperature % 10,Font);

	// Celsius degree sign
	HLine(X + 1,X + 2,Y,PSet);
	HLine(X + 1,X + 2,Y + 3,PSet);
	VLine(X,Y + 1,Y + 2,PSet);
	VLine(X + 3,Y + 1,Y + 2,PSet);
	PutChar(X + 5,Y,'C',Font);

	return X - pX + 10;
}

// Draw vertical menu with scrolling
// input:
//   X,Y - top left menu corner coordinates
//   W,H - width and height of menu
//   Font - pointer to font
//   Menu - pointer to Menu_TypeDef structure, containing menu
//   StartPos - start menu position
//   WaitForKey - function pointer to WaitForKeyPress function
// return:
//   selected menu position or 0xff if "Escape" key pressed
uint8_t GUI_Menu(uint8_t X, uint8_t Y, uint8_t W, uint8_t H, const Font_TypeDef *Font,
		MenuFrame_TypeDef MenuFrame, const Menu_TypeDef *Menu, uint8_t StartPos,
		funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t i;
	int8_t scrPos; // Cursor position related to screen
	int8_t scrOfs; // Menu scroll (number of first displayed item)
	uint8_t yy;
	uint8_t Cr; // Right side of the menu cursor
	uint8_t Cl; // Left side of the menu cursor
	uint8_t miYoffs; // First menu item vertical offset
	uint8_t sbTH; // Height of scrollbar thumb
	uint8_t sbH; // Height of scrollbar
	uint8_t sbTY; // Vertical position of the scrollbar thumb
	uint8_t scrItems; // Visible menu items
	uint8_t MIH; // Menu item height

	// Menu frame
	switch (MenuFrame) {
		case MF_rect:
			Rect(X,Y,X + W - 1,Y + H - 1,PSet);
			X += 1;
			Y += 1;
			W -= 2;
			H -= 2;
			break;
		case MF_top_bottom:
			HLine(X,X + W - 1,Y,PSet);
			HLine(X,X + W - 1,Y + H - 1,PSet);
			Y += 1;
			H -= 2;
		default:
			// No frame
			break;
	}

	Cl = X;
	Cr = Cl + W - 1;
	if (MenuFrame == MF_rect) {
		Cl++;
		Cr--;
	}

	MIH = Font->font_Height + 2;
	scrItems = (H - 3) / MIH;
	if (scrItems < Menu->NumItems) {
		sbTH = ((H - 3) * scrItems ) / Menu->NumItems;
		if (sbTH < 2) sbTH = 2;
		Cr -= 4;
		sbH = H - 3;
	} else {
		sbTH = 0;
		sbH  = 0;
	}
	if (scrItems > Menu->NumItems) scrItems = Menu->NumItems;
	miYoffs = ((H - 6 - (scrItems * MIH)) / 2) - 1;

	if (StartPos > Menu->NumItems) StartPos = 0;
	if (StartPos >= scrItems) {
		if (StartPos <= Menu->NumItems - scrItems) {
			scrPos = (scrItems * StartPos) / Menu->NumItems;
			scrOfs = StartPos - scrPos;
		} else {
			scrOfs = Menu->NumItems - scrItems;
			scrPos = StartPos - scrOfs;
		}
	} else {
		scrPos = StartPos;
		scrOfs = 0;
	}

	while(1) {
		ClearKeys();

		// Clear menu background
		FillRect(X,Y,X + W - 1,Y + H - 1,PReset);

		// Draw scrollbar
		if (sbH > 0) {
			sbTY = Y + 1 + (((scrPos + scrOfs) * (sbH - sbTH)) / (Menu->NumItems - 1));
			VLine(Cr + 3,Y + 1,Y + 1 + sbH,PSet);
			VLine(Cr + 4,sbTY,sbTY + sbTH,PSet);
			VLine(Cr + 2,sbTY,sbTY + sbTH,PSet);
		}

		// Draw menu items
		yy = Y + 4 + miYoffs;
		for (i = scrOfs; i < scrOfs + scrItems; i++) {
			// If MenuAlign given something other except MA_left - it will be centered
			if (Menu->MenuAlign == MA_left) {
				sbTY = 1;
			} else {
				sbTY = ((Cr - Cl + 1) / 2) - ((stringlen(Menu->Items[i].ItemName) * (Font->font_Width + 1)) / 2);
			}
			PutStr(Cl + sbTY,yy + 1,Menu->Items[i].ItemName,Font);
			if (i - scrOfs == scrPos) InvertRect(Cl,yy,Cr - Cl + 1,MIH);
			yy += MIH;
		}
		UC1701_Flush();

