LonelyWolf/stm32/bike-computer/GUI.c
		// Wait for key press
		if (WaitForKey) WaitForKey(FALSE,NULL);
		_idle_time = 0;

		// Up button
		if (BTN[BTN_UP].cntr || BTN[BTN_UP].state == BTN_Hold) {
			scrPos--;
			if (scrPos < 0) {
				scrPos = 0;
				scrOfs--;
				if (scrOfs < 0) {
					if (Menu->MenuScroll == MS_normal) {
						scrOfs = 0;
						scrPos = 0;
					} else {
						scrOfs = Menu->NumItems - scrItems;
						scrPos = scrItems - 1;
					}
				}
			}
		}

		// Down button
		if (BTN[BTN_DOWN].cntr || BTN[BTN_DOWN].state == BTN_Hold) {
			scrPos++;
			if (scrPos > scrItems - 1) {
				scrPos = scrItems - 1;
				scrOfs++;
				if (scrOfs > Menu->NumItems - scrItems) {
					if (Menu->MenuScroll == MS_normal) {
						scrPos = scrItems - 1;
						scrOfs = Menu->NumItems - scrItems;
					} else {
						scrPos = 0;
						scrOfs = 0;
					}
				}
			}
		}

		// "Enter" button
		if (BTN[BTN_ENTER].cntr) {
			ClearKeys();
			return scrPos + scrOfs;
		}

		// "Escape" button
		if (BTN[BTN_ESCAPE].cntr) {
			ClearKeys();
			return 0xff;
		}
	}
}

// Adjust numeric value with up/down buttons
// input:
//   X - left horizontal coordinate of dialog
//       if this value is negative -> dialog right horizontal coordinate
//   Y - top vertical coordinate of dialog
//       if this value is negative -> dialog bottom vertical coordinate
//   W - width of dialog (zero for auto size)
//   H - height of dialog (zero for auto size)
//   Value - start numeric value
//   Min - minimum value
//   Max - maximum value
//   Step - step change of numeric value
//   unit - unit to add to value
//   CallBack - pointer to function, which will be called on every Value change
//   WaitForKey - function pointer to WaitForKeyPress function
void GUI_NumericScroll(int8_t X, int8_t Y, uint8_t W, uint8_t H, int32_t *Value,
		int32_t Min, int32_t Max, int32_t Step, char *unit,	funcPtrParam_TypeDef CallBack,
		funcPtrKeyPress_TypeDef WaitForKey) {
	uint8_t i;
	uint8_t vY; // Numeric value vertical coordinate
	uint8_t mid; // Middle horizontal position
	int32_t val = *Value; // Value to change
	uint8_t frame_width = W;
	uint8_t frame_height = H;

	// Check range
	if (val > Max || val < Min) val = Min + ((Max - Min) >> 1);

	// Calculate dialog width
	if (W == 0) {
		i = stringlen(unit) + numlen(Min);
		mid = stringlen(unit) + numlen(Max);
		if (i > mid) mid = i;
		frame_width = (mid * 6) + 3;
	}

	// Calculate dialog height
	if (H == 0) frame_height = 29;

	// If X negative -> adjust dialog left horizontal coordinate
	if (X < 0) X = (-1 * X) - frame_width;

	// If Y negative -> adjust dialog top horizontal coordinate
	if (Y < 0) Y = (-1 * Y) - frame_height + 1;

	// Middle of dialog
	vY = Y + ((frame_height - 4) / 2) - 1;
	mid = X + (frame_width / 2) + 1; // Middle of the dialog window

	// Dialog frame
	Rect(X,Y,X + frame_width,Y + frame_height - 1,PSet);

	while(1) {
		ClearKeys();

		// Call a callback function
		if (CallBack) CallBack(val);

		// Clear dialog background
		FillRect(X + 1,Y + 1,X + frame_width - 1,Y + frame_height - 2,PReset);

		// Draw up/down arrows
		for (i = 6; i > 0; i --) {
			if (val + Step <= Max) HLine(mid - i,mid + i - 1,vY + i - 10,PSet);
			if (val - Step >= Min) HLine(mid - i,mid + i - 1,vY - i + 16,PSet);
		}

		// Draw value
		i = mid - ((stringlen(unit) + numlen(val)) * 3);
		i += PutInt(i,vY,val,&Font5x7) + 1;
		PutStr(i,vY,unit,&Font5x7);
		InvertRect(X + 1,vY - 2,frame_width - 1,11);
		UC1701_Flush();

		// Wait for key press
		if (WaitForKey) WaitForKey(FALSE,NULL);
		_idle_time = 0;

		// Up button
		if (BTN[BTN_UP].cntr || BTN[BTN_UP].state == BTN_Hold) {
			val += Step;
			if (val > Max) val = Max;
			BTN[BTN_UP].cntr = 0;
		}

		// Down button
		if (BTN[BTN_DOWN].cntr || BTN[BTN_DOWN].state == BTN_Hold) {
			val -= Step;
			if (val < Min) val = Min;
			BTN[BTN_DOWN].cntr = 0;
		}

		// "Enter" button
		if (BTN[BTN_ENTER].cntr) {
			*Value = val;
			if (CallBack) CallBack(*Value);
			ClearKeys();
			return;
		}

		// "Escape" button
		if (BTN[BTN_ESCAPE].cntr) {
			// Restore old value by calling callback function with original value
			if (CallBack) CallBack(*Value);
			ClearKeys();
			return;
		}
	}
}

// Main menu with sub menus
void GUI_MainMenu(void) {
	uint8_t mnu_sel;
	uint8_t mnu_sub_sel;
	int32_t mnu_val;

	ClearKeys();
	mnu_sel = 0;
	do {
		mnu_sel = GUI_Menu(0,0,scr_width,scr_height,&Font7x10,MF_none,
				&mnuMain,mnu_sel,WaitForKeyPress);
		mnu_sub_sel = 0;
		switch (mnu_sel) {
		case 0:
			// Statistics
			do {
				UC1701_Fill(0x00);
				PutStr(11,1,"Statistics...",&Font7x10);
				InvertRect(0,0,scr_width,12);
				mnu_sub_sel = GUI_Menu(5,11,scr_width - 10,scr_height - 11,&Font7x10,MF_rect,
						&mnuStatistics,mnu_sub_sel,WaitForKeyPress);
				if (mnu_sub_sel != 0xff) switch (mnu_sub_sel) {
					case 0:
						// Sensor RAW values
						GUI_Screen_SensorRAW(WaitForKeyPress);
						break;
					case 1:
						// Current trip values
						GUI_Screen_CurVal1(WaitForKeyPress);
						break;
					case 2:
						// BMP180 current values
						GUI_Screen_CurVal2(WaitForKeyPress);
						break;
					case 3:
						// GPS current values
						GUI_Screen_CurVal3(WaitForKeyPress);
						break;
					default:
						break;
				}
			} while (mnu_sub_sel != 0xff);
			break;
		case 1:
			// GPS
			do {
				UC1701_Fill(0x00);
				PutStr(39,1,"GPS...",&Font7x10);
				InvertRect(0,0,scr_width,12);
				mnu_sub_sel = GUI_Menu(10,11,scr_width - 20,scr_height - 18,&Font7x10,MF_rect,
						&mnuGPS,mnu_sub_sel,WaitForKeyPress);
				if (mnu_sub_sel != 0xff) switch (mnu_sub_sel) {
					case 0:
						GUI_Screen_GPSSatsView(WaitForKeyPress);
						break;
					case 1:
						GUI_Screen_GPSInfo(WaitForKeyPress);
						break;
					case 2:
						GUI_Screen_Buffer(GPS_buf,GPS_BUFFER_SIZE,&GPS_new_data,WaitForKeyPress);
						break;
					default:
						break;
				}
			} while (mnu_sub_sel != 0xff);
			break;
		case 2:
			// Settings
			do {
				UC1701_Fill(0x00);
				PutStr(19,1,"Settings...",&Font7x10);
				InvertRect(0,0,scr_width,12);
				mnu_sub_sel = GUI_Menu(10,11,scr_width - 20,scr_height - 11,&Font7x10,MF_rect,
						&mnuSettings,mnu_sub_sel,WaitForKeyPress);
				if (mnu_sub_sel != 0xff) switch (mnu_sub_sel) {
					case 0:
						do {
							UC1701_Fill(0x00);
							PutStr(19,1,"Display...",&Font7x10);
							InvertRect(0,0,scr_width,12);
							mnu_sub_sel = GUI_Menu(2,11,scr_width - 4,scr_height - 22,&Font7x10,MF_rect,
									&mnuDisplay,mnu_sub_sel,WaitForKeyPress);
							if (mnu_sub_sel != 0xff) switch (mnu_sub_sel) {
								case 0:
									mnu_val = Settings.LCD_brightness;
									GUI_NumericScroll(-100,10,0,0,&mnu_val,0,100,5,"%",callback_Brightness,WaitForKeyPress);
									Settings.LCD_brightness = (uint8_t)mnu_val;
									break;
								case 1:
									mnu_val = Settings.LCD_timeout;
									GUI_NumericScroll(-100,10,0,0,&mnu_val,0,120,15,"s",NULL,WaitForKeyPress);
									Settings.LCD_timeout = (uint8_t)mnu_val;
									break;
								case 2:
									break;
								default:
									break;
							}
						} while (mnu_sub_sel != 0xff);
						mnu_sub_sel = 0;
						break;
					case 1:
						mnu_val = Settings.WheelCircumference;
						GUI_NumericScroll(-100,10,0,0,&mnu_val,150,300,1,"cm",NULL,WaitForKeyPress);
						Settings.WheelCircumference = (uint16_t)mnu_val;
						break;
					case 2:
						mnu_val = Settings.GMT_offset;
						GUI_NumericScroll(-100,10,0,0,&mnu_val,-12,13,1,"hr",NULL,WaitForKeyPress);
						Settings.GMT_offset = (int8_t)mnu_val;
						break;
					case 3:
						mnu_val = Settings.altitude_home;
						GUI_NumericScroll(-100,10,0,0,&mnu_val,-1000,9999,1,"m",NULL,WaitForKeyPress);
						Settings.altitude_home = (int16_t)mnu_val;
						break;
					default:
						break;
				}
				SaveSettings_EEPROM();
			} while (mnu_sub_sel != 0xff);
			break;
		case 3:
			// Debug
			do {
				UC1701_Fill(0x00);
				PutStr(31,1,"Debug...",&Font7x10);
				InvertRect(0,0,scr_width,12);
				mnu_sub_sel = GUI_Menu(0,12,scr_width,scr_height - 13,&Font7x10,MF_none,
						&mnuTest,mnu_sub_sel,WaitForKeyPress);
			} while (mnu_sub_sel != 0xff);
		default:
			break;
		}
	} while (mnu_sel != 0xff);

	ClearKeys();
}

// Show screensaver
void GUI_ScreenSaver(void) {
	bool key_pressed = FALSE;
	uint32_t itts = 0;

	do {
		UC1701_Fill(0x00);
//		GUI_DrawTime(30,11,&RTC_Time,TT_Short,DS_Big);
		GUI_DrawTime(12,11,&RTC_Time,TT_Full,DS_Big);
		GUI_PutDate(33,scr_height - 12,(RTC_Date.RTC_Date * 1000000) + (RTC_Date.RTC_Month * 10000) +
				RTC_Date.RTC_Year + 2000,&Font5x7);
		PutInt(1,1,itts,&Font5x7);
		UC1701_Flush();
		SleepStop(); // Enter STOP mode (deep sleep)
		key_pressed = BTN[0].cntr || BTN[1].cntr || BTN[2].cntr || BTN[3].cntr ||
				BTN[0].state == BTN_Hold || BTN[1].state == BTN_Hold ||
				BTN[2].state == BTN_Hold || BTN[3].state == BTN_Hold;
 		itts++;
	} while (!key_pressed);
	ClearKeys();
}
